# นายจีรพัฒน์ มูลตรีศรี 6310680035
## การศึกษา microcontroller ผ่านเว็บไซต์ Risc-V
ซึ่งนี้ก็เป็นหน้าตาของเว็บไซต์ที่เราจะใช้ศึกษา microcontroller กันในแลปนี้ =========================================
  
![image](https://user-images.githubusercontent.com/98943413/160634066-7bfa3978-991d-452f-b484-c26481f0c038.png)
  
- โดยเริ่มต้นจากฝั่งซ้าย ซึ่งก็คือ **Memory** ================================================================
  
![image](https://user-images.githubusercontent.com/98943413/160635590-e641c4d0-df5a-47c7-9954-9d3e83047b27.png)
  
- ต่อมาเป็นด้านล่างซึ่งจะเป็น input และ output ทั้งหมด โดยเริ่มจากฝั่งซ้ายเป็น **Text I/O** ซึ่งก็คือตัวหนังสือ โดยผ่านการเขียนโปรแกรมที่เป็นภาษา Assembly ที่ใหม่ล่าสุดและเปิดให้ใช้แบบเปิดเผย  
- ถัดมาเป็น **General-purpose I/O** คือ I/O ที่ใช้งานได้ทั่วไป ตัวอย่างเช่น การควบคุม sensor ที่เมื่อรับแสงจะมีค่าเป็น 1 และเป็น 0 เมื่อไม่ได้รับแสง เป็นต้น  
- ถัดมาเป็น **Bitmap output** ซึ่งเป็นการวาดภาพผ่านการเขียนโปรแกรมบน memory ===============================

![image](https://user-images.githubusercontent.com/98943413/160636360-465bfa49-e52b-4e9e-a14e-9fc282d5eb6d.png)

- ด้านขวาสุดคือ **General-purpose register** เป็นหน่วยความจำขนาดเล็กจะอยู่ข้างใน CPU ซึ่งจะมีจำนวนแค่ 32 ตัว ซึ่งน้อยกว่า Memory ที่มีจำนวนมากกว่า เช่น 8 GB หรือ 16 GB หรือมากกว่านั้น ======================================================

![image](https://user-images.githubusercontent.com/98943413/160651899-77a701ce-1906-4af3-979b-5a906a1b5250.png)

## คำสั่งหลักๆที่ใช้ในการทดลองนี้
จะอธิบายคำสั่งเป็นลำดับด้วยภาพนี้ประกอบ ดังนี้

![image](https://user-images.githubusercontent.com/98943413/160661881-bbf19b6a-250e-41c5-a12a-091521e6cb20.png)

1. add immediate (addi) คือ การเอาเลข 32 มาบวกกับเลขที่ x0 ที่เป็น General-purpose regs แล้วไปใส่ใน x1 (ซึ่ง x0 เป็นค่า register พิเศษ ซึ่งมีค่าแค่ 0 เสมอแก้ค่าไม่ได้ แต่ x1 , x2 , ... x31 เราสามารถแก้ไขได้)
2. low upper immediate (lui) คือ การเอาค่าที่อยู่ทางขวาที่มีค่า 32 bit เมื่อเปลี่ยนเป็นเลขฐาน 16 ก็จะได้ 8 ตัวอักษร ไปใส่ใน x2 โดยใส่แค่ 20 bit แรก  
3. load byte unsigned (lbu) คือ การเอาหน่วยความจำที่ x1 จำนวน 1 byte มาใส่ใน x3
4. branch on equal (beq) คือ ถ้าในกรณีที่ x3 เท่ากับ x0 จะบวกเข้าไป 16 แล้ว jumpไป +16 ของ address
5. store byte (sb) คือ การนำข้อมูลใน x3 ที่ไม่เป็น 0 ไปเก็บไว้ใน address ของ x2
6. คำสั่ง jal หรือ jump คือ การกำหนดไปยังค่าที่เราได้กำหนดไว้ เช่น ถ้ากำหนดไว้ -16 ก็จะ jumpถอยหลังไป 16 หรือถ้ากำหนดไว้เป็น 0 ก็จะวน loop ซ้ำอยู่ที่เดิมนั่นเอง

## การทดลองใส่ชื่อ-นามสกุลย่อของตัวเอง
โดยเริ่มต้นจะตาราง **Ascii chart** เพื่อใช้ในการเปรียบเทียบอักษรที่จะใช้ในการทดสอบโปรแกรม

![image](https://user-images.githubusercontent.com/98943413/160671377-de80bfce-981c-4624-bd44-b1d04a594114.png)

1. เปลี่ยนค่าใน address 20 ให้เป็นรหัส Ascii ในชื่อภาษาอังกฤษตัวแรกเป็นพิมพ์ใหญ่ และทำเหมือนกันใน address 21 แต่เป็นนามสกุลภาษาอังกฤษตัวแรกแบบพิมพ์ใหญ่  
2. เราจำเป็นต้องเปลี่ยนค่าใน address ที่ 22 , 23 , 24 ให้เป็น 00 เพื่อให้โปรแกรมวน loop ซ้ำเป็นการกำหนดค่าเพื่อให้แสดงแค่ค่าที่ต้องการในข้อ 1 นั่นเอง  

## ก็จะได้ผลลัพธ์เป็น JM = Jeerapat Moolteesri

![image](https://user-images.githubusercontent.com/98943413/160670879-798d2212-7d9c-4cf0-8c23-862373eca276.png)

